/*Дефинирайте клас, който описва колода от карти със следните характеристики:

масив от карти (обекти от класа, дефиниран в предходната задача);
индекс top, който посочва коя е картата на върха на колодата.
Дефинирайте конструктор по поразбиране, който инициализира колодата от 52 карти. Дефинирайте член-функции за:

извеждане на колодата на стандартния изход;
проверка дали колодата е празна
// дали са раздадени всички карти
bool isEmpty() const;
раздаване на карта: връща се картата, която е най-отгоре на колодата;
разбъркване на картите в колодата. Можете да използвате алгоритъма на Fisher - Yates.*/

#ifndef Deck_H
#define Deck_H
#include"Cards.h"

class Deck{
private:
	Card* cards;
	int top;
	int maxCapacity = 52;
public:
	Deck();
	Deck(const Deck&);
	~Deck();
	Deck& operator=(const Deck&);
	void print()const;
	bool isEmpty()const;
	Card& giveCard();
	void mixDeck();
};

#endif 